# Brewfile — matches current state of this Mac (2026-04-23).
# Run `brew bundle install` from this folder to restore the setup on a new Mac.
# Preview what would change with `brew bundle check --verbose`.

cask_args appdir: '/Applications'

# Taps
tap 'homebrew/bundle'

# CLI tools
brew 'cloudflared'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'imagemagick'
brew 'python@3.12'
brew 'render'

# GUI apps
cask '1password'
cask '1password-cli'
cask 'betterdisplay'
cask 'chatgpt'
cask 'claude'
cask 'cleanshot'
cask 'cmux'
cask 'descript'
cask 'docker'
cask 'elgato-control-center'
cask 'figma'
cask 'google-chrome'
cask 'google-drive'
cask 'loom'
cask 'notion'
cask 'notion-calendar'
cask 'notion-mail'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'zoom'

# Mac App Store apps (requires `mas` and being signed in to the App Store)
mas 'Spokenly',        id: 6740315592
mas 'Toggl Track',     id: 1291898086
mas 'WhatsApp',        id: 310633997

# VS Code / Cursor extensions